/*
- Quiz2. 
아래 요구사항에 맞는 코드를 작성하고 
브라우저에서 실행하여 테스트하세요.
- 요구사항
1. prompt 창을 띄워 사용자에게 숫자를 입력해 달라고 요청한 후, 
   입력받은 값들을 배열에 순차적으로 저장합니다.
   
2. '그만'이라고 입력하면 질문을 멈추고
   입력했던 숫자배열과 숫자의 총합(배열 요소의 합)을 계산하여 출력하세요.
*/

 var listNum = [];

while (true) {   // numbers.length < 6 -> 입력받은 숫자의 길이가 6이되면 그만하게 하기
  var inputNum = prompt(`숫자를 입력하세요. \n그만두려면 '그만'이라고 입력하세요.`);
  
  if (inputNum === '그만')
    break;
    
    listNum.push(+inputNum); 
}

var totalNum = 0;
for (var i = 0; i < listNum.length; i++) {
  totalNum += listNum[i];
}

alert(`입력한 숫자 목록 ${listNum}\n입력한 숫자 총합 : ${totalNum}`);


// 숫자놓을 배열 1.

// 사용자에게 숫자 입력 받기 2.

// 입력받은 숫자를 배열에 추가 3. (입력한 배열 데이터가 알맞게 나오는지 확인)

// 그만이라고 할 때 출력 제대로 되는 위치 찾아주기 4.
// 그만이라는 문자열 -> 숫자로 나오도록 하기 위해 +prompt에서 + 빼기

// 총합 반복문 5.

// alert 출력문 !

// * 타입 맞춰주는거 주의 ! 흘러가는 흐름에 알맞는 위치에 넣어주는거 연습하기 !!

