/*
- Quiz1) 아래 요구사항에 맞는 코드를 작성하고 
        브라우저에서 실행하여 테스트하세요.
- 요구사항 
1. 사용자는 신장(키)과 나이의 정보를 숫자로 입력할 수 있어야 함.
2. 프로그램은 2가지 정보를 입력하고 엔터를 누르면 조건에 따라 
   다른 결과를 출력해야 함.

3. 키가 140이상이고 나이가 8세이상인 2개의 조건을 모두 만족할 경우 
   “놀이기구에 탑승할 수 있습니다.”를 출력할 것.

4. 두 개의 조건 중 하나라도 만족하지 않을 시 
   “놀이기구에 탑승할 수 없습니다”를 출력할 것.

5. 조건과는 관계없이 “오늘 하루 즐거운 시간되세요!”를 출력할 것!
<힌트> 논리 연산자를 사용해 볼 것!
*/
// var userHeight = prompt('당신의 키는 ?');
// var userAge = prompt('당신의 나이는 ?');

// if (userHeight >= 140 && userAge >= 8) {
//   alert('놀이기구에 탑승할 수 있습니다.');
// } else {
//   alert('놀이기구에 탑승할 수 없습니다.');
// }
// alert('오늘 하루 즐거운 시간되세요 :)');

console.log('=================================');

// Q2) 정수 3번 입력해서 3개 값이 모두 같습니다.
var n1 = +prompt('정수 A');
var n2 = +prompt('정수 B');
var n3 = +prompt('정수 C');

if (n1 === n2 && n2 === n3) {
  alert('3개 값이 모두 같습니다.');
} else if (n1 === n2 || n2 === n3 || n3 === n1) {
  alert('2개 값이 같습니다.');
} else {
  alert('모든 값이 다릅니다.');
}

// Q3) 정수 2개 입력 받아 두 값의 차이 구하기.
var n1 = +prompt('정수 A');
var n2 = +prompt('정수 B');

var diff = (n1 > n2) ? n1 - n2 : n2 - n1;

alert(`두 값의 차이는 ${diff}입니다.`);

// Q4) 정수 3개 입력 후 최소값 구하기.
var n1 = +prompt('정수 A');
var n2 = +prompt('정수 B');
var n3 = +prompt('정수 C');

var min = n1;
if (n2 < min) min = n2;
if (n3 < min) min = n3;

alert(`최소값은 ${min} 입니다.`);

